<?php
    $mysqli = mysqli_connect("localhost", "team03", "team03", "team03");

    if(mysqli_connect_error()){
        prinf("Connect failed: %s\n", mysqli_connect_error());
        exit();
    }else{
        $sql="CREATE TABLE wildNatureTable(POI_NM VARCHAR(75) PRIMARY KEY, CATEGORY VARCHAR(75), CITY VARCHAR(75), DONG VARCHAR(75), LI VARCHAR(75), ROAD_NAME VARCHAR(75))";
        $res=mysqli_query($mysqli, $sql);

        $sql="INSERT INTO wildNatureTable(POI_NM, CATEGORY, CITY, DONG, LI, ROAD_NAME)
        VALUES
        ('삼천사계곡', '폭포/계곡', '서울', '진관동','-', '대선문길'),
        ('탐라계곡', '폭포/계곡', '제주', '오라이동','-','-'),
        ('안덕계곡상록수림', '폭포/계곡', '제주', '안덕면', '감산리','-'),
        ('도봉계곡', '폭포/계곡', '서울', '도봉동','-','-'),
        ('삼폭포', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('청학동계곡', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('인공폭포', '폭포/계곡', '목포', '옥암동','-', '녹색로'),
        ('정방폭포', '폭포/계곡', '제주', '동홍동','-', '칠십리로 214번길'),
        ('장산폭포', '폭포/계곡', '부산', '우동','-','-'),
        ('인왕산수성동계곡', '폭포/계곡', '서울', '옥인동','-','-'),
        ('비룡폭포', '폭포/계곡', '속초', '설악동','-', '설악산로'),
        ('구룡폭계곡', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('소금강계곡', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('구룡폭포', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('선녀폭포', '폭포/계곡', '제주', '해안동','-','-'),
        ('천상연폭포', '폭포/계곡', '제주', '색달동','-', '색달로 189번길'),
        ('소정방폭포', '폭포/계곡', '제주', '동홍동','-','-'),
        ('백사실계곡', '폭포/계곡', '서울', '부암동','-','-'),
        ('어위폭포', '폭포/계곡', '제주', '표선면', '토산리','-'),
        ('정수암계곡', '폭포/계곡', '여수', '중흥동','-','-'),
        ('애기소계곡', '폭포/계곡', '북구', '화명동','-','-'),
        ('여근곡', '폭포/계곡', '경주', '건천읍', '신평리', '원신길'),
        ('아흔아홉골', '폭포/계곡', '제주', '노형동','-','-'),
        ('온천천인공폭포', '폭포/계곡', '부산', '명륜동','-','-'),
        ('토왕성폭포', '폭포/계곡', '속초', '설악동','-', '설악산로'),
        ('운곡폭포', '폭포/계곡', '경주', '강동면', '왕신리','-'),
        ('천폭포', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('구천폭포', '폭포/계곡', '서울', '수유동','-', '4.19로 28길'),
        ('저항령계곡', '폭포/계곡', '속초', '설악동','-','-'),
        ('더불어숲', '숲', '서울', '항동','-','-'),
        ('안덕계곡', '폭포/계곡', '제주', '안덕면', '감산리','-'),
        ('우이동계곡', '폭포/계곡', '서울', '우이동','-', '삼양로 179길'),
        ('대왕폭포', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('육담폭포', '폭포/계곡', '속초', '설악동','-', '설악산로'),
        ('천당폭포', '폭포/계곡', '속초', '설악동','-', '설악산로'),
        ('이연폭포', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('노추산계곡', '폭포/계곡', '강릉', '왕산면', '대기리','-'),
        ('북서울꿈의숲월광폭포', '폭포/계곡', '서울', '번동','-', '월계로'),
        ('염주폭포', '폭포/계곡', '속초', '설악동','-', '설악산로'),
        ('세심폭포', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('경포해수욕장폭포', '폭포/계곡', '강릉', '안현동','-','-'),
        ('추사와전각', '숲', '제주', '안덕면', '사계리','-'),
        ('부연동계곡', '폭포/계곡', '강릉', '연곡면', '삼산리','-'),
        ('천불동계곡', '폭포/계곡', '속초', '설악동','-', '설악산로'),
        ('강동아름숲', '숲', '서울', '명일동','-','-'),
        ('진관사계곡', '폭포/계곡', '서울', '진관동','-', '진관길'),
        ('수악계곡', '폭포/계곡', '제주', '남원읍', '신례리','-')";

        $res = mysqli_query($mysqli, $sql);
        
        if($res === TRUE){
            echo "wildNatureTable Table records are succesfully inserted.";
        }else{
            printf("Could not create table: %s\n", mysqli_error($mysqli));
        }
        
        mysqli_close($mysqli);
    }
?>