<?php
    $mysqli = mysqli_connect("localhost", "team03", "team03", "team03");

    if(mysqli_connect_error()){
        prinf("Connect failed: %s\n", mysqli_connect_error());
        exit();
    }else{
        $sql="CREATE TABLE famousSpotTable(POI_NM VARCHAR(75) PRIMARY KEY, CATEGORY VARCHAR(75), CITY VARCHAR(75), DONG VARCHAR(75), LI VARCHAR(75), ROAD_NAME VARCHAR(75))";
$res=mysqli_query($mysqli, $sql);

        $sql="INSERT INTO famousSpotTable(POI_NM, CATEGORY, CITY, DONG, LI, ROAD_NAME)
        VALUES
        ('경주보문관광단지', '유명관광지', '경주', '신평동', '-', '보문로'),
        ('용두암공원용두암', '유명관광지', '제주', '용담이동', '-', '서해안로'),
        ('용머리촬영지', '유명관광지', '제주', '안덕면', '사계리', '-'),
        ('소인국테마파크', '유명관광지', '제주', '안덕면', '서광리', '중산간서로'),
        ('경주민속공예촌', '유명관광지', '경주', '하동', '-', '-'),
        ('제주전농로벚꽃거리', '유명관광지', '제주', '삼도일동', '-', '-'),
        ('용머리해안', '유명관광지', '제주', '안덕면', '사계리', '-'),
        ('전주한옥마을', '유명관광지', '전주', '풍남동3가', '-', '-'),
        ('경주엑스포공원', '유명관광지', '경주', '천군동', '-', '경감로'),
        ('하귀애월해안도로', '유명관광지', '제주', '애월읍', '구엄리', '-'),
        ('강원관광정보센터', '유명관광지', '속초', '조양동', '-', '엑스포로'),
        ('협재관광지', '유명관광지', '제주', '한림읍', '협재리', '-'),
        ('해돋이공원', '유명관광지', '강릉', '강동면', '정동진리', '-'),
        ('생각하는정원', '유명관광지', '제주', '한경면', '저지리', '녹차분재로'),
        ('제주시민속오일시장', '유명관광지', '제주', '도두일동', '-', '오일장서길'),
        ('한림공원', '유명관광지', '제주', '한림읍', '협재리', '한림로'),
        ('신창풍차해안도로', '유명관광지', '제주', '한경면', '신창리', '한경해안로'),
        ('제주월드컵경기장워터월드', '유명관광지', '제주', '법환동', '-', '월드컵로'),
        ('김녕해안도로', '유명관광지', '제주', '구좌읍', '김녕리', '-'),
        ('우도팔경유람선', '유명관광지', '제주', '성산읍', '성산리', '성산등용로'),
        ('종달리해안도로', '유명관광지', '제주', '구좌읍', '종달리', '-'),
        ('백야등대', '유명관광지', '여수', '화정면', '백야리', '백야등대길'),
        ('어리목', '유명관광지', '제주', '해안동', '-', '1100로'),
        ('정동진', '유명관광지', '강릉', '강동면', '정동진리', '정동역길'),
        ('용수해안도로', '유명관광지', '제주', '한경면', '용수리', '-'),
        ('산굼부리', '유명관광지', '제주', '조천읍', '교래리', '비자림로'),
        ('종달해안도로', '유명관광지', '제주', '성산읍', '오조리', '-'),
        ('김녕미로공원', '유명관광지', '제주', '구좌읍', '김녕리', '만장굴길'),
        ('제주러브랜드', '유명관광지', '제주', '연동', '-', '1100로'),
        ('행원풍력발전단지', '유명관광지', '제주', '구좌읍', '행원리', '-'),
        ('보문산전망대', '유명관광지', '대전', '대사동', '-', '-'),
        ('종달고망난돌쉼터', '유명관광지', '제주', '구좌읍', '종달리', '-'),
        ('하멜기념비', '유명관광지', '제주', '안덕면', '사계리', '-'),
        ('대유랜드', '유명관광지', '제주', '상예동', '-', '상예로'),
        
        ('미남크루즈해양관광', '유명관광지', '여수', '덕충동', '-', '엑스포대로'),
        ('도깨비공원', '유명관광지', '제주', '조천읍', '선흘리', '번영로'),
        ('혼인지', '유명관광지', '제주', '성산읍', '온평리', '혼인지로'),
        ('제주조각공원', '유명관광지', '제주', '안덕면', '덕수리', '일주서로'),
        ('퍼시픽리솜', '유명관광지', '제주', '색달동', '-', '중문관광로'),
        ('봉개관광승마장', '유명관광지', '제주', '봉개동', '-', '-'),
        ('중문관광단지', '유명관광지', '제주', '색달동', '-', '중문관광로'),
        ('청와대', '유명관광지', '서울', '세종로', '-', '청와대로'),
        ('남산공원남산케이블카', '유명관광지', '서울', '회현동1가', '-', '소파로'),
        ('을숙도철새공원', '유명관광지', '부산', '하단동', '-', '-'),
        ('고산해안도로', '유명관광지', '제주', '한경면', '고산리', '노을해안로'),
        ('주간명월', '유명관광지', '제주', '우도면', '연평리', '-'),
        ('쉬리의언덕', '유명관광지', '제주', '색달동', '-', '-'),
        ('신창용수해안도로', '유명관광지', '제주', '한경면', '신창리', '한경해안로'),
        ('유채꽃재배단지', '유명관광지', '제주', '성산읍', '고성리', '-'),
        ('가마해안도로', '유명관광지', '제주', '표선면', '세화리', '-'),
        ('청계천', '유명관광지', '서울', '관수동', '-', '-'),
        ('별도봉공원', '유명관광지', '제주', '화북일동', '-', '사라봉동길'),
        ('경주동궁과월지', '유명관광지', '경주', '인왕동', '-', '원화로'),
        ('야구인의마을', '유명관광지', '제주', '색달동', '-', '색달중앙로252번길'),
        ('자연한방테마파크', '유명관광지', '제주', '안덕면', '서광리', '녹차분재로'),
        ('신양해안도로', '유명관광지', '제주', '성산읍', '고성리', '-'),
        ('청초호갯배', '유명관광지', '속초', '청호동', '-', '설악금강대교로'),
        ('추사유배길인연의길', '유명관광지', '제주', '안덕면', '서광리', '-'),
        ('대포주상절리대', '유명관광지', '제주', '중문동', '-', '이어도로'),
        ('향일암', '유명관광지', '여수', '돌산읍', '율림리', '향일암로'),
        ('모래시계공원', '유명관광지', '강릉', '강동면', '정동진리', '-'),
        ('우도잠수함', '유명관광지', '제주', '성산읍', '성산리', '성산등용로'),
        ('산방산랜드', '유명관광지', '제주', '안덕면', '사계리', '-'),
        ('을숙도공원', '유명관광지', '부산', '하단동', '-', '-'),
        ('정낭', '유명관광지', '제주', '표선면', '성읍리', '번영로'),
        ('우도봉수대', '유명관광지', '제주', '우도면', '연평리', '우도해안길'),
        ('남산서울타워', '유명관광지', '서울', '용산동2가', '-', '남산공원길'),
        ('일과해안도로', '유명관광지', '제주', '대정읍', '일과리', '-'),
        ('섭지코지', '유명관광지', '제주', '성산읍', '고성리', '섭지코지로'),
        ('제주드림랜드승마카트클럽', '유명관광지', '제주', '애월읍', '봉성리', '평화로'),
        ('신화레져버기카', '유명관광지', '제주', '안덕면', '동광리', '동광로'),
        ('추사적거지', '유명관광지', '제주', '대정읍', '안성리', '추사로'),
        ('사라봉공원', '유명관광지', '제주', '건입동', '-', '사라봉동길'),
        ('새별오름관광타운', '유명관광지', '제주', '애월읍', '봉성리', '평화로'),
        ('수월봉', '유명관광지', '제주', '한경면', '고산리', '-')";

        $res = mysqli_query($mysqli, $sql);
        
        if($res === TRUE){
            echo "naturalParkTable Table records are succesfully inserted.";
        }else{
            printf("Could not create table: %s\n", mysqli_error($mysqli));
        }
        
        mysqli_close($mysqli);
    }
?>

