
<?php
    $mysqli = mysqli_connect("localhost", "team03", "team03", "team03");

    if(mysqli_connect_error()){
        prinf("Connect failed: %s\n", mysqli_connect_error());
        exit();
    }else{
        $sql="CREATE TABLE naturalParkTable(POI_NM VARCHAR(75) PRIMARY KEY, CATEGORY VARCHAR(75), CITY VARCHAR(75), DONG VARCHAR(75), LI VARCHAR(75), ROAD_NAME VARCHAR(75))";
$res=mysqli_query($mysqli, $sql);

$sql="INSERT INTO naturalParkTable(POI_NM, CATEGORY, CITY, DONG, LI, ROAD_NAME)
VALUES
('미평산림욕장', '휴양림/수목원', '여수', '미평동', '-', '-'),
('최남단체험감귤농장', '관광농원/허브마을', '제주', '남원읍', '남원리', '남위남성로'),
('호암산잣나무산림욕장', '휴양림/수목원', '서울', '시흥동', '-', '호암로'),
('회천관광농원', '관광농원/허브마을', '제주', '회천동', '-', '번영로'),
('불암산산림치유센터', '식물원', '서울', '중계동', '-', '한글비석로12길'),
('삼정관광농원', '관광농원/허브마을', '제주', '구좌읍', '한동리', '일주동로'),
('산죽한옥마을관광농원', '관광농원/허브마을', '경주', '마동', '-', '불국로'),
('서달산수목학습원', '휴양림/수목원', '서울', '흑석동', '-', '-'),
('한라수목원', '휴양림/수목원', '제주', '연동', '-', '수목원길'),
('장동산림욕장', '휴양림/수목원', '대전', '장동', '-', '-'),
('설악산자생식물원', '식물원', '속초', '노학동', '-', '-'),
('뒷뜨루관광농원', '관광농원/허브마을', '강릉', '사천면', '석교리', '청솔공원길'),
('명도암참살이체험농장', '관광농원/허브마을', '제주', '봉개동', '-', '명림로'),
('사정골식물원', '식물원', '대전', '사정동', '-', '사정공원로'),
('아차산유아숲체험장', '휴양림/수목원', '서울', '중곡동', '-', '긴고랑로'),
('행국이농장', '관광농원/허브마을', '제주', '한경면', '낙천리', '낙산로'),
('명도암휴양목장명도암관광농원', '관광농원/허브마을', '제주', '봉개동', '-', '명림로'),
('도예원', '관광농원/허브마을', '군산', '성산면', '창오리', '창오1길'),
('토함산자연휴양림', '휴양림/수목원', '경주', '문무대왕면', '장항리', '불국로'),
('전북농어촌종합지원센터', '관광농원/허브마을', '전주', '중동', '-', '오공로'),
('탐라농장', '관광농원/허브마을', '제주', '노형동', '-', '1100로'),
('스누피가든', '관광농원/허브마을', '제주', '구좌읍', '송당리', '금백조로'),
('볕뜰농원', '관광농원/허브마을', '군산', '대야면', '보덕리', '보덕안정길'),
('산소리숲학교', '휴양림/수목원', '전주', '용복동', '-', '독배길'),
('무릉관광농원', '관광농원/허브마을', '경주', '강동면', '호명리', '호국로'),
('에덴의정원수목장', '휴양림/수목원', '전주', '효자동3가', '-', '콩쥐팥쥐로'),
('서귀다원', '관광농원/허브마을', '제주', '상효동', '-', '516로'),
('최남단곤충체험농장', '관광농원/허브마을', '제주', '남원읍', '남원리', '남위남성로'),
('해운대수목원', '휴양림/수목원', '부산', '석대동', '-', '-'),
('여수난지식물원', '식물원', '여수', '주삼동', '-', '주동1길'),
('담담', '관광농원/허브마을', '경주', '강동면', '왕신리', '천강로'),
('귤밭에콘테나', '관광농원/허브마을', '제주', '조천읍', '와산리', '-'),
('강릉솔향수목원', '휴양림/수목원', '강릉', '구정면', '구정리', '수목원길'),
('금천구친환경주말농장', '관광농원/허브마을', '서울', '시흥동', '-', '-'),
('녹고뫼캠핑장관광농원', '관광농원/허브마을', '제주', '애월읍', '유수암리', '유수암평화10길'),
('장작골농원', '관광농원/허브마을', '강릉', '강동면', '언별리', '윗장작골길'),
('보문산숲치유센터', '휴양림/수목원', '대전', '대사동', '-', '보문산공원로'),
('제주동백수목원', '휴양림/수목원', '제주', '남원읍', '위미리', '-'),
('금정농원', '관광농원/허브마을', '부산', '두구동', '-', '두구로51번길'),
('귤향체험농원', '관광농원/허브마을', '제주', '성산읍', '수산리', '-'),
('대관령자연휴양림', '휴양림/수목원', '강릉', '성산면', '어흘리', '삼포암길'),
('홍익수목원', '휴양림/수목원', '제주', '남원읍', '신례리', '신례동로'),
('해송식물원', '식물원', '목포', '용해동', '-', '입암천북로12번길'),
('베짱이유아숲체험장', '식물원', '서울', '독산동', '-', '독산로54길'),
('오등감귤농장', '관광농원/허브마을', '제주', '오등동', '-', '오등14길'),
('열린수목원', '휴양림/수목원', '속초', '조양동', '-', '청대로'),
('한국성경식물원', '식물원', '제주', '성산읍', '난산리', '-'),
('대일관광농원', '관광농원/허브마을', '제주', '애월읍', '광령리', '무수천길'),
('한국도로공사수목원', '식물원', '전주', '반월동', '-', '번영로'),
('서울숲유아숲체험장', '휴양림/수목원', '서울', '성수동1가', '-', '뚝섬로')";

        $res = mysqli_query($mysqli, $sql);
        
        if($res === TRUE){
            echo "naturalParkTable Table records are succesfully inserted.";
        }else{
            printf("Could not create table: %s\n", mysqli_error($mysqli));
        }
        
        mysqli_close($mysqli);
    }
?>